In [69]:
import pandas as pd
import numpy as np

In [70]:
df = pd.read_excel('test.xlsx')
df

      nom  genre  salaire           metier  aanciennete  age
0    marc  homme    10000         jardiner            5   25
1  gillou  homme        0         etudiant           10   25
2  calvin  homme     5000         banquier            1   24
3    joao  homme        0         etudiant           10   25
4     leo  femme    10000       biologiste            5   30
5     lea  femme    10000  informatitienne            5   30

In [71]:
df_salaire = df[df['salaire']>0]
df_salaire

      nom  genre  salaire           metier  aanciennete  age
0    marc  homme    10000         jardiner            5   25
2  calvin  homme     5000         banquier            1   24
4     leo  femme    10000       biologiste            5   30
5     lea  femme    10000  informatitienne            5   30

In [72]:
df_femme = df[df['genre'] == 'femme']
df_femme

   nom  genre  salaire           metier  aanciennete  age
4  leo  femme    10000       biologiste            5   30
5  lea  femme    10000  informatitienne            5   30

In [73]:
df_homme_0_c_1 = (df['genre']=='homme')
df_homme_0_c_2 = (df['salaire']>0)
df_homme_0 = df[df_homme_0_c_1  & df_homme_0_c_2]
df_homme_0

      nom  genre  salaire    metier  aanciennete  age
0    marc  homme    10000  jardiner            5   25
2  calvin  homme     5000  banquier            1   24

In [74]:
df_loc_t = df.loc[[0,4]]
df_loc_t

    nom  genre  salaire      metier  aanciennete  age
0  marc  homme    10000    jardiner            5   25
4   leo  femme    10000  biologiste            5   30

In [75]:
df_iloc_t = df.iloc[1:4, [2,4]]
df_iloc_t

   salaire  aanciennete
1        0           10
2     5000            1
3        0           10

In [76]:
df[df['genre'] == 'homme'][['salaire','metier','nom']]

   salaire    metier     nom
0    10000  jardiner    marc
1        0  etudiant  gillou
2     5000  banquier  calvin
3        0  etudiant    joao

In [77]:
df.loc[[2],['salaire', 'metier']]

   salaire    metier
2     5000  banquier

In [78]:
print(df['genre']=='homme')

0     True
1     True
2     True
3     True
4    False
5    False
Name: genre, dtype: bool

In [82]:
df.loc[df['genre'] == 'homme','salaire'] = 0

In [83]:
df

      nom  genre  salaire           metier  aanciennete  age
0    marc  homme        0         jardiner            5   25
1  gillou  homme        0         etudiant           10   25
2  calvin  homme        0         banquier            1   24
3    joao  homme        0         etudiant           10   25
4     leo  femme    10000       biologiste            5   30
5     lea  femme    10000  informatitienne            5   30

In [85]:
print(df.groupby('genre')['salaire'].mean())

genre
femme    10000
homme        0
Name: salaire, dtype: int64